In [1]:
import numpy as np
import pandas as pd

In [3]:
d = {
        'Jan' :[1,2,np.nan],
        'Feb' :[4,np.nan,np.nan],
        'Mar' :[7,8,9]
}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

   Jan  Feb  Mar
0  1.0  4.0    7
1  2.0  NaN    8
2  NaN  NaN    9

In [6]:
df.dropna()

   Jan  Feb  Mar
0  1.0  4.0    7

In [7]:
df.dropna(axis=1)

   Mar
0    7
1    8
2    9

In [8]:
df.dropna(thresh=2)

   Jan  Feb  Mar
0  1.0  4.0    7
1  2.0  NaN    8

In [9]:
df

   Jan  Feb  Mar
0  1.0  4.0    7
1  2.0  NaN    8
2  NaN  NaN    9

In [10]:
df.fillna(value = 'FILL VALUE')

          Jan         Feb  Mar
0           1           4    7
1           2  FILL VALUE    8
2  FILL VALUE  FILL VALUE    9

In [12]:
df['Jan'].fillna(value = df['Jan'].mean())

0    1.0
1    2.0
2    1.5
Name: Jan, dtype: float64